
#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
//		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьГруппаСкидкаНаФорму(Форма);
//	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
//		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
//	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
//		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
//	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
//		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
//	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
//		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

//Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
//
//	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
//	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
//	ПолеВвода.ПутьКДанным = "Объект.ДК_КонтактноеЛицо";
//
//КонецПроцедуры
//
//Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
//	
//	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.СуммаДокумента);
//	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
//	ПолеВвода.ПутьКДанным = "Объект.ДК_КонтактноеЛицо";	
//
//КонецПроцедуры 

Процедура ДобавитьГруппаСкидкаНаФорму(Форма)

	ГруппаСкидка = Форма.Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПолеВвода = Форма.Элементы.Добавить("ДК_СогласованнаяCкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДК_СогласованнаяCкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "ДК_СогласованнаяCкидкаПриИзменении");
	
	Команда = Форма.Команды.Добавить("ДК_ПрименитьСкидку");
	Команда.Заголовок = "Применить скидку";
	Команда.Действие = "ДК_ПрименитьСкидку";
	
	Кнопка = Форма.Элементы.Добавить("ДК_ПрименитьСкидку", Тип("КнопкаФормы"), ГруппаСкидка);
	Кнопка.ИмяКоманды = "ДК_ПрименитьСкидку";
	
КонецПроцедуры


#КонецОбласти
